; domain
(define (domain grid)
(:requirements :strips :typing)
(:types place shape key)
(:predicates (conn ?x ?y - place)
             (key-shape ?k - key ?s - shape)
             (lock-shape ?x - place ?s - shape)
             (at ?r - key ?x - place )
       (at-robot ?x - place)
             (locked ?x - place)
             (carrying ?k - key)
             (open ?x - place)
)


(:action unlock
:parameters (?curpos ?lockpos - place ?key - key ?shape - shape)
:precondition (and (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (carrying ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos)))
)

(:action move
:parameters (?curpos ?nextpos - place)
:precondition (and (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos)))
)

(:action pickup
:parameters (?curpos - place ?key - key)
:precondition (and (at-robot ?curpos) (at ?key ?curpos))
:effect (and (carrying ?key)
   (not (at ?key ?curpos)))
))

; problem
(define (problem strips-grid-1)
(:domain grid)
(:objects node_A node_B node_C node_D node_E
node_F node_G - place
triangle square circle star - shape
key0 key1 key2 key3 - key )
(:init
(conn node_A node_B)
(conn node_B node_A)
(conn node_B node_C)
(conn node_C node_B)
(conn node_C node_F)
(conn node_F node_C)
(conn node_C node_G)
(conn node_G node_C)
(conn node_C node_D)
(conn node_D node_C)
(conn node_D node_E)
(conn node_E node_D)
(open node_A)
(locked node_B)
(lock-shape node_B square)
(open node_C)
(locked node_D)
(lock-shape node_D triangle)
(open node_E)
(locked node_F)
(lock-shape node_F circle)
(locked node_G)
(lock-shape node_G star)
(key-shape key0 triangle)
(at key0 node_C)
(key-shape key1 square)
(at key1 node_C)
(key-shape key2 circle)
(at key2 node_A)
(key-shape key3 star)
(at key3 node_E)
(at-robot node_C)
)
(:goal
(and
(at-robot node_F)
)
)
)

; plan
1. (pickup node_c key1)
   deleted: (at key1 node_c)
   added: (carrying key1)
   goals met: 0 of 1
2. (unlock node_c node_b key1 square)
   deleted: (locked node_b)
   added: (open node_b)
   goals met: 0 of 1
3. (move node_c node_b)
   deleted: (at-robot node_c)
   added: (at-robot node_b)
   goals met: 0 of 1
4. (move node_b node_a)
   deleted: (at-robot node_b)
   added: (at-robot node_a)
   goals met: 0 of 1
5. (pickup node_a key2)
   deleted: (at key2 node_a)
   added: (carrying key2)
   goals met: 0 of 1
6. (move node_a node_b)
   deleted: (at-robot node_a)
   added: (at-robot node_b)
   goals met: 0 of 1
7. (move node_b node_c)
   deleted: (at-robot node_b)
   added: (at-robot node_c)
   goals met: 0 of 1
8. (unlock node_c node_f key2 circle)
   deleted: (locked node_f)
   added: (open node_f)
   goals met: 0 of 1
9. (move node_c node_f)
   deleted: (at-robot node_c)
   added: (at-robot node_f)
   goals met: 1 of 1
